app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(params[:employee])
    if @employee.save
---
INSERT INTO "employees" ("created_at", "email", "manager_id", "name", "phone", "session_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @employee = Employee.find(params[:id])

    if @employee.update_attributes(params[:employee])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "employees" SET "email" = 'staff23@test.com', "updated_at" = '2013-12-10 01:21:37.098554' WHERE "employees"."id" = 3