app/controllers/sessions_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."email" = 'manager1@test.com' LIMIT 1
---
  def create
    user = Employee.find_by_email(
      params[:employee][:email],
    )